Revit 2027 API
ScheduleField.VerticalAlignment Property
 The vertical alignment of the column's data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleVerticalAlignment VerticalAlignment { get; set; }
Public Property VerticalAlignment As ScheduleVerticalAlignment
	Get
	Set
public:
property ScheduleVerticalAlignment VerticalAlignment {
	ScheduleVerticalAlignment get ();
	void set (ScheduleVerticalAlignment value);
}
member VerticalAlignment : ScheduleVerticalAlignment with get, set
Property Value
ScheduleVerticalAlignment
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace